%% Definition Tuple
1> T = {john,25,{june,16}}.
{john,25,{june,16}}

%% Tuple grÃ¶sse, Wert abgreifen
2> tuple_size(T).
3
3> element(1, T).
john
4> element(1, element(3, T)).
june
5> T2 = setelement(2, T, 43).
{john,43,{june,16}}
